import sqlite3
c = sqlite3.connect("myDataBase.db")
cu = c.cursor()
cu.execute("""CREATE TABLE Model
              (id VARCHAR(4) PRIMARY KEY,
               Product VARCHAR(10),
               Сharacteristic VARCHAR(100),
               Existence VARCHAR(15)
               )""")
c.commit()
cu.execute("""CREATE TABLE Score
              (NumBuy INTEGER PRIMARY KEY,
               Customer VARCHAR(50),
               Shop_assistant VARCHAR(50),
               Model_id VARCHAR(4),
               Data TIMESTAMP,
               Cost REAL,
               Status VARCHAR(10),
               FOREIGN KEY (Model_id) REFERENCES Model(id)
               )""")
c.commit()



Model = [('M001', 'Мяч', 'Футбольный,красный', '20 шт'),
         ('M002', 'Мяч', 'Волейбольный,пляжный', '2 шт'),
         ('К001', 'Кроссовки', 'Adidas', '100 шт'),
         ('К002', 'Кроссовки', 'Reebok', '15 шт'),
         ('К003', 'Кроссовки', 'Nike', '8 шт'),
         ('Ке11', 'Кепка', 'Темная', '500 шт'),
         ('Ке12', 'Кепка', 'Светлая', '12 шт')
         ]
 
cu.executemany("INSERT INTO Model VALUES (?,?,?,?)", Model)

c.commit()


Score = [('1', 'Свантовский Борис Аркадьевич', 'Светланцова А.А', 'М001', '2019-05-01 08:36:56.200', '1000', 'Доставлен'),
         ('2', 'Чумаева Анастасия Владимировна', 'Светланцова А.А', 'М001', '2019-05-02 15:15:03.200', '1000', 'На складе'),
         ('3', 'Глянцев Максим Николаевич', 'Борзаренко В.В', 'М002', '2019-05-01 20:36:28.200', '1100', 'В пути'),
         ('4', 'Кравцева Наталья Юрьевна', 'Меньшиков В.А', 'К001', '2019-05-05 12:36:46.200', '6000', 'В пути'),
         ('5', 'Переладов Андрей Макисмович', 'Меньшиков В.А', 'М002', '2019-05-03 08:55:51.200', '1100', 'На складе'),
         ('6', 'Шорохов Дима Витальевич', 'Светланцова А.А', 'К001', '2019-05-06 18:40:17.200', '6000', 'Доставлен'),
         ('7', 'Цунаева Ирина Дмитриевна', 'Светланцова А.А', 'К003', '2019-05-05 14:01:00.200', '18000', 'Доставлен'),
         ('8', 'Ключивский Владимир Михаилович', 'Борзаренко В.В', 'К002', '2019-05-02 10:08:44.200', '12000', 'На складе'),
         ('9', 'Евдокимов Антон Кириллович', 'Умальдин К.С', 'Ке11', '2019-05-01 16:55:47.200', '800', 'Доставлен'),
         ('10', 'Мамаева Диана Вячеславовна', 'Тверин В.И', 'Ке12', '2019-05-05 09:22:11.200', '500', 'Доставлен'),
         ('11', 'Дацук Дарья Александровна', 'Светланцова А.А', 'К001', '2019-05-06 13:34:11.200', '6000', 'В пути'),
         ('12', 'Ливак Анна Вадимовна', 'Шишкина А.Д', 'К002', '2019-05-02 14:45:22.200', '12000', 'Доставлен'),
         ('13', 'Моркин Даниил Сергеевич', 'Тверин В.И', 'К003', '2019-05-05 17:33:56.200', '18000', 'В пути'),
         ('14', 'Функ Павел Анатольевич', 'Умальдин К.С', 'Ке11', '2019-05-03 19:08:05.200', '800', 'На складе'),
         ('15', 'Алексеева Марина Дмитриевна', 'Меньшиков В.А', 'Ке11', '2019-05-02 13:12:45.200', '800', 'На складе'),
         ('16', 'Карась Михаил Игоревич', 'Умальдин К.С', 'Ке12', '2019-05-01 18:17:15.200', '500', 'На складе'),
         ('17', 'Смок Олег Алексеевич', 'Умальдин К.С', 'Ке12', '2019-05-02 13:22:46.200', '500', 'Доставлен'),
         ('18', 'Некрасова Юлиана Владимировна', 'Борзаренко В.В', 'М001', '2019-05-02 15:43:50.200', '1000', 'Доставлен')
         ]
 
cu.executemany("INSERT INTO Score VALUES (?,?,?,?,?,?,?)", Score)

c.commit()


cu.execute("SELECT * FROM Model")
row1= cu.fetchmany(20)
cu.execute("SELECT * FROM Score")
row2 = cu.fetchmany(20)
print(row1)
print(row2)




c.close()
